Revit 2027 API
AlignmentStationLabel.CreateRecommendedTypeForSet Method
 Creates an element type recommended for alignment label sets and returns its ElementId.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId CreateRecommendedTypeForSet(
	Document document
)
Public Shared Function CreateRecommendedTypeForSet (
	document As Document
) As ElementId
public:
static ElementId^ CreateRecommendedTypeForSet(
	Document^ document
)
static member CreateRecommendedTypeForSet :
        document : Document -> ElementId
Parameters
document Document
The document in which the type will be created.
Return Value
ElementId
Remarks
 The crucial features of the label type recommended for sets are: - rotate with component - vertical text - label display includes station value - leader arrow head has type "Heavy End Tick Mark"
See Also
Reference
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace